src/Documents/СчетКонтрагента/СчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетКонтрагента</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправкиГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиГруза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОриентировачнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитнаяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыОперацийСчетКонтрагента/ВидыОперацийСчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСчетКонтрагента</name>
  <enumValues>
    <name>СТранспортнойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>СЭкспедиторскойКомпанией</name>
  </enumValues>
</mdclass:Enum>

src/Documents/СчетКонтрагента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура РаспределитьПоВесуНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объект.Сумма,ДокОбъект.Организаторы.ВыгрузитьКолонку("Вес"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Сумма");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоВесу(Команда)
	РаспределитьПоВесуНаСервере();
	элементы.гпСтраницы.ТекущаяСтраница=Элементы.гпСтраницы.ПодчиненныеЭлементы.ГруппаСтоимостьПоОрганизаторам;
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоОбъемуНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объект.Сумма,ДокОбъект.Организаторы.ВыгрузитьКолонку("Объем"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Сумма");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоОбъему(Команда)
	РаспределитьПоОбъемуНаСервере();
	элементы.гпСтраницы.ТекущаяСтраница=Элементы.гпСтраницы.ПодчиненныеЭлементы.ГруппаСтоимостьПоОрганизаторам;
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоКоличествуНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объект.Сумма,ДокОбъект.Организаторы.ВыгрузитьКолонку("Количество"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Сумма");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры


&НаКлиенте
Процедура РаспределитьПоКоличеству(Команда)
	РаспределитьПоКоличествуНаСервере();
	элементы.гпСтраницы.ТекущаяСтраница=Элементы.гпСтраницы.ПодчиненныеЭлементы.ГруппаСтоимостьПоОрганизаторам;
КонецПроцедуры


Процедура УстановитьВидимость()
	сТК=(Объект.ВидОперации=перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией);
	элементы.ГруппаСтоимостьПоОрганизаторам.Видимость=сТК;
	элементы.РаспределитьПоОбъему.Видимость=сТК;
	элементы.РаспределитьПоВесу.Видимость=сТК;
	элементы.РаспределитьПоКоличеству.Видимость=сТК;
	элементы.ОриентировачнаяДатаДоставки.Видимость=сТК;
	элементы.ГруппаВесОбъем.Видимость=сТК;
	//Элементы.ТранзитнаяТочка.Видимость= не сТК;	
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если не ЗначениеЗаполнено(Объект.ТранзитнаяТочка) Тогда
		Объект.ТранзитнаяТочка = СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду("0039");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесаНаСервере()
	докОбъект=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.СчетКонтрагента"));
	докОбъект.ЗаполнитьВесОбъемПоГрузу();
	ЗначениеВДанныеФормы(докОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВеса(Команда)
	ЗаполнитьВесаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	ВесПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВесПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	ДокОбъект.УстановитьПроценты();
	массИтог= аСПНаСервере.РаспределитьПропорционально(ДокОбъект.Вес,ДокОбъект.Организаторы.ВыгрузитьКолонку("ВесПроцент"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Вес");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	ОбъемПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъемПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));
	ДокОбъект.УстановитьПроценты();
	массИтог= аСПНаСервере.РаспределитьПропорционально(ДокОбъект.Объем,ДокОбъект.Организаторы.ВыгрузитьКолонку("ОбъемПроцент"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Объем");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыВесПриИзменении(Элемент)
	ОрганизаторыВесПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизаторыВесПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	ДокОбъект.Вес=Объект.Организаторы.Итог("Вес");
	массИтог= аСПНаСервере.РаспределитьПропорционально(100,ДокОбъект.Организаторы.ВыгрузитьКолонку("Вес"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"ВесПроцент");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыОбъемПриИзменении(Элемент)
	ОрганизаторыОбъемПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизаторыОбъемПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	ДокОбъект.Объем=Объект.Организаторы.Итог("Объем");
	массИтог= аСПНаСервере.РаспределитьПропорционально(100,ДокОбъект.Организаторы.ВыгрузитьКолонку("Объем"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"ОбъемПроцент");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыВесПроцентПриИзменении(Элемент)
	ОрганизаторыВесПроцентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизаторыВесПроцентПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объект.Вес,ДокОбъект.Организаторы.ВыгрузитьКолонку("ВесПроцент"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Вес");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыОбъемПроцентПриИзменении(Элемент)
	ОрганизаторыОбъемПроцентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизаторыОбъемПроцентПриИзмененииНаСервере()
	ДокОбъект=ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.СчетКонтрагента"));	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объект.Объем,ДокОбъект.Организаторы.ВыгрузитьКолонку("ОбъемПроцент"));
	Если   массИтог=неопределено Тогда Возврат; КонецЕсли;
	ДокОбъект.Организаторы.ЗагрузитьКолонку(массИтог,"Объем");
	ЗначениеВДанныеФормы(ДокОбъект,Объект);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(Заказы)
	//массивГрузов=Заказы.Выгрузить().ВыгрузитьКолонку("Груз");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиВТКПриАктивизацииСтроки(Элемент)
	ОтобратьПоЗаявке();
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоЗаявке()
	Если ОтбиратьПоЗаявкам Тогда
		Элементы.Заказы.ОтборСтрок=Новый ФиксированнаяСтруктура("Заявка",Элементы.ЗаявкиВТК.ТекущиеДанные.Заявка);
	Иначе
		Элементы.Заказы.ОтборСтрок=неопределено;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОтбиратьПоЗаявкамПриИзменении(Элемент)
	ОтобратьПоЗаявке();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьВсеЗаявки");
КонецПроцедуры
